slowpoke/synthetic/fanout-w10-http-sync/archive/microbench-bus-theory/fanout-w10-http-sync-service0-t1-c1-req2000-poker30000000-n1-rep1-flush-in-delay.log
[config.py] Random numbers for execution time: [457.8190171971569, 510.5244189842223, 569.5877680219319, 681.5840739845216, 759.3515679562805, 826.3618367022134, 909.8265613867029, 932.441954121777, 984.287486755421, 994.5039736858845, 1033.5791531668715]
benchmark                        : synthetic
num_threads                      : 1
num_conns                        : 1
target_service                   : service0
request_type                     : fanout-w10-http-sync
repetitions                      : 1
target_num_exp                   : 1
pre_run                          : False
num_req                          : 2000
groundtruths                     : []
slowdowns                        : []
predicteds                       : []
errs                             : []
client_cpu_quota                 : 2
random_seed                      : 29513
request_ratio                    : {'service0': 1, 'service1': 1, 'service2': 1, 'service3': 1, 'service4': 1, 'service5': 1, 'service6': 1, 'service7': 1, 'service8': 1, 'service9': 1, 'service10': 1}
baseline_service_processing_time : {'service0': 1033.58, 'service1': 994.5, 'service2': 984.29, 'service3': 932.44, 'service4': 909.83, 'service5': 826.36, 'service6': 759.35, 'service7': 681.58, 'service8': 569.59, 'service9': 510.52, 'service10': 457.82}
cpu_quota                        : {'service0': 2, 'service1': 2, 'service2': 2, 'service3': 2, 'service4': 2, 'service5': 2, 'service6': 2, 'service7': 2, 'service8': 2, 'service9': 2, 'service10': 2}
target_processing_time_range     : [0, 1033.58]
baseline_throughputs             : []
poker_batch                      : 30000000
[test.py] Starting experiment...
[test.py] >>>>>>>>>>>>>>>>>>>>>>>>>>>>> Running experiment 0...
[test.py] Actual processing time range: [0]
[test.py] Running baseline experiment
    [exp] Running (pre_run: False) workload synthetic/fanout-w10-http-sync request with the following configuration: {'CLIENT_CPU_QUOTA': '2', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '30000000', 'PROCESSING_TIME_SERVICE0': '0.00103358', 'PROCESSING_TIME_SERVICE1': '0.0009945', 'PROCESSING_TIME_SERVICE2': '0.00098429', 'PROCESSING_TIME_SERVICE3': '0.00093244', 'PROCESSING_TIME_SERVICE4': '0.00090983', 'PROCESSING_TIME_SERVICE5': '0.00082636', 'PROCESSING_TIME_SERVICE6': '0.00075935', 'PROCESSING_TIME_SERVICE7': '0.00068158', 'PROCESSING_TIME_SERVICE8': '0.00056959', 'PROCESSING_TIME_SERVICE9': '0.00051052', 'PROCESSING_TIME_SERVICE10': '0.00045782', 'SLOWPOKE_DELAY_MICROS_SERVICE0': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE1': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE2': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE3': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE4': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE5': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE6': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE7': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE8': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE9': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE10': '0.0'}
    [exp] Executing cmd `bash run.sh synthetic fanout-w10-http-sync 1 1 2000`:
        [run.sh] Running benchmark synthetic with request fanout-w10-http-sync, thread 1, conn 1, duration 60
        [run.sh] Deleting all services
        configmap "config-service0" deleted
        deployment.apps "service0" deleted
        service "service0" deleted
        configmap "config-service1" deleted
        deployment.apps "service1" deleted
        service "service1" deleted
        configmap "config-service10" deleted
        deployment.apps "service10" deleted
        service "service10" deleted
        configmap "config-service2" deleted
        deployment.apps "service2" deleted
        service "service2" deleted
        configmap "config-service3" deleted
        deployment.apps "service3" deleted
        service "service3" deleted
        configmap "config-service4" deleted
        deployment.apps "service4" deleted
        service "service4" deleted
        configmap "config-service5" deleted
        deployment.apps "service5" deleted
        service "service5" deleted
        configmap "config-service6" deleted
        deployment.apps "service6" deleted
        service "service6" deleted
        configmap "config-service7" deleted
        deployment.apps "service7" deleted
        service "service7" deleted
        configmap "config-service8" deleted
        deployment.apps "service8" deleted
        service "service8" deleted
        configmap "config-service9" deleted
        deployment.apps "service9" deleted
        service "service9" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        configmap/config-service0 created
        deployment.apps/service0 created
        service/service0 created
        configmap/config-service1 created
        deployment.apps/service1 created
        service/service1 created
        configmap/config-service10 created
        deployment.apps/service10 created
        service/service10 created
        configmap/config-service2 created
        deployment.apps/service2 created
        service/service2 created
        configmap/config-service3 created
        deployment.apps/service3 created
        service/service3 created
        configmap/config-service4 created
        deployment.apps/service4 created
        service/service4 created
        configmap/config-service5 created
        deployment.apps/service5 created
        service/service5 created
        configmap/config-service6 created
        deployment.apps/service6 created
        service/service6 created
        configmap/config-service7 created
        deployment.apps/service7 created
        service/service7 created
        configmap/config-service8 created
        deployment.apps/service8 created
        service/service8 created
        configmap/config-service9 created
        deployment.apps/service9 created
        service/service9 created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t1 -c1 -d3s -L http://service0:80/endpoint1
        Running 3s test @ http://service0:80/endpoint1
        1 threads and 1 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency    23.36ms   34.14ms 231.15ms   93.24%
        Req/Sec    65.32     15.80    80.00     89.29%
        Latency Distribution
        50%   14.17ms
        75%   14.56ms
        90%   19.67ms
        99%  199.38ms
        189 requests in 3.00s, 421.93KB read
        Requests/sec:     62.95
        Transfer/sec:    140.53KB
        [run.sh] Speed is 62.95, duration is 47
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t1 -c1 -d47s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
        [run.sh] Checking the resource usage
        Running 47s test @ http://service0:80/endpoint1
        1 threads and 1 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency    14.14ms  452.44us  19.26ms   83.60%
        Req/Sec    70.74      3.12    80.00     89.72%
        Latency Distribution
        50%   14.02ms
        75%   14.26ms
        90%   14.65ms
        99%   15.90ms
        2000 requests in 47.00s, 4.36MB read
        Requests/sec:     42.55
        Transfer/sec:     95.00KB
        ------------------------------
        stop time: 28.283555
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
        > error: metrics not available yet
    [exp] Times: [28.283555]
    [exp] Throughput: 70.7124687826548
[test.py] Baseline throughput: 70.7124687826548
[test.py] Running groundtruth experiment
    [exp] Running (pre_run: False) workload synthetic/fanout-w10-http-sync request with the following configuration: {'CLIENT_CPU_QUOTA': '2', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '30000000', 'PROCESSING_TIME_SERVICE0': '0.0', 'PROCESSING_TIME_SERVICE1': '0.0009945', 'PROCESSING_TIME_SERVICE2': '0.00098429', 'PROCESSING_TIME_SERVICE3': '0.00093244', 'PROCESSING_TIME_SERVICE4': '0.00090983', 'PROCESSING_TIME_SERVICE5': '0.00082636', 'PROCESSING_TIME_SERVICE6': '0.00075935', 'PROCESSING_TIME_SERVICE7': '0.00068158', 'PROCESSING_TIME_SERVICE8': '0.00056959', 'PROCESSING_TIME_SERVICE9': '0.00051052', 'PROCESSING_TIME_SERVICE10': '0.00045782', 'SLOWPOKE_DELAY_MICROS_SERVICE0': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE1': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE2': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE3': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE4': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE5': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE6': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE7': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE8': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE9': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE10': '0.0'}
    [exp] Executing cmd `bash run.sh synthetic fanout-w10-http-sync 1 1 2000`:
        [run.sh] Running benchmark synthetic with request fanout-w10-http-sync, thread 1, conn 1, duration 60
        [run.sh] Deleting all services
        configmap "config-service0" deleted
        deployment.apps "service0" deleted
        service "service0" deleted
        configmap "config-service1" deleted
        deployment.apps "service1" deleted
        service "service1" deleted
        configmap "config-service10" deleted
        deployment.apps "service10" deleted
        service "service10" deleted
        configmap "config-service2" deleted
        deployment.apps "service2" deleted
        service "service2" deleted
        configmap "config-service3" deleted
        deployment.apps "service3" deleted
        service "service3" deleted
        configmap "config-service4" deleted
        deployment.apps "service4" deleted
        service "service4" deleted
        configmap "config-service5" deleted
        deployment.apps "service5" deleted
        service "service5" deleted
        configmap "config-service6" deleted
        deployment.apps "service6" deleted
        service "service6" deleted
        configmap "config-service7" deleted
        deployment.apps "service7" deleted
        service "service7" deleted
        configmap "config-service8" deleted
        deployment.apps "service8" deleted
        service "service8" deleted
        configmap "config-service9" deleted
        deployment.apps "service9" deleted
        service "service9" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        configmap/config-service0 created
        deployment.apps/service0 created
        service/service0 created
        configmap/config-service1 created
        deployment.apps/service1 created
        service/service1 created
        configmap/config-service10 created
        deployment.apps/service10 created
        service/service10 created
        configmap/config-service2 created
        deployment.apps/service2 created
        service/service2 created
        configmap/config-service3 created
        deployment.apps/service3 created
        service/service3 created
        configmap/config-service4 created
        deployment.apps/service4 created
        service/service4 created
        configmap/config-service5 created
        deployment.apps/service5 created
        service/service5 created
        configmap/config-service6 created
        deployment.apps/service6 created
        service/service6 created
        configmap/config-service7 created
        deployment.apps/service7 created
        service/service7 created
        configmap/config-service8 created
        deployment.apps/service8 created
        service/service8 created
        configmap/config-service9 created
        deployment.apps/service9 created
        service/service9 created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t1 -c1 -d3s -L http://service0:80/endpoint1
        Running 3s test @ http://service0:80/endpoint1
        1 threads and 1 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency    14.81ms   10.77ms 109.61ms   96.93%
        Req/Sec    75.00      9.06    80.00     96.55%
        Latency Distribution
        50%   12.97ms
        75%   13.17ms
        90%   13.82ms
        99%   82.43ms
        221 requests in 3.00s, 493.37KB read
        Requests/sec:     73.58
        Transfer/sec:    164.26KB
        [run.sh] Speed is 73.58, duration is 40
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t1 -c1 -d40s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        service1-fc9b56d49-wsp9t         1m           3Mi
        service10-78485db999-7k8cj       1m           3Mi
        service3-5c6d85cdf9-77498        3m           3Mi
        ubuntu-client-76886f6bbd-wlnfc   1m           0Mi
        Running 40s test @ http://service0:80/endpoint1
        1 threads and 1 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency    13.06ms  429.08us  18.25ms   82.20%
        Req/Sec    76.54      4.77    80.00     65.52%
        Latency Distribution
        50%   12.95ms
        75%   13.19ms
        90%   13.61ms
        99%   14.63ms
        2000 requests in 40.00s, 4.36MB read
        Requests/sec:     50.00
        Transfer/sec:    111.62KB
        ------------------------------
        stop time: 26.135390
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
    [exp] Times: [26.13539]
    [exp] Throughput: 76.52458983776404
[test.py] Running slowdown experiment
    [exp] Running (pre_run: False) workload synthetic/fanout-w10-http-sync request with the following configuration: {'CLIENT_CPU_QUOTA': '2', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '30000000', 'PROCESSING_TIME_SERVICE0': '0.00103358', 'PROCESSING_TIME_SERVICE1': '0.0009945', 'PROCESSING_TIME_SERVICE2': '0.00098429', 'PROCESSING_TIME_SERVICE3': '0.00093244', 'PROCESSING_TIME_SERVICE4': '0.00090983', 'PROCESSING_TIME_SERVICE5': '0.00082636', 'PROCESSING_TIME_SERVICE6': '0.00075935', 'PROCESSING_TIME_SERVICE7': '0.00068158', 'PROCESSING_TIME_SERVICE8': '0.00056959', 'PROCESSING_TIME_SERVICE9': '0.00051052', 'PROCESSING_TIME_SERVICE10': '0.00045782', 'SLOWPOKE_DELAY_MICROS_SERVICE0': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE1': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE2': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE3': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE4': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE5': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE6': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE7': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE8': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE9': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE10': '516.5'}
    [exp] Executing cmd `bash run.sh synthetic fanout-w10-http-sync 1 1 2000`:
        [run.sh] Running benchmark synthetic with request fanout-w10-http-sync, thread 1, conn 1, duration 60
        [run.sh] Deleting all services
        configmap "config-service0" deleted
        deployment.apps "service0" deleted
        service "service0" deleted
        configmap "config-service1" deleted
        deployment.apps "service1" deleted
        service "service1" deleted
        configmap "config-service10" deleted
        deployment.apps "service10" deleted
        service "service10" deleted
        configmap "config-service2" deleted
        deployment.apps "service2" deleted
        service "service2" deleted
        configmap "config-service3" deleted
        deployment.apps "service3" deleted
        service "service3" deleted
        configmap "config-service4" deleted
        deployment.apps "service4" deleted
        service "service4" deleted
        configmap "config-service5" deleted
        deployment.apps "service5" deleted
        service "service5" deleted
        configmap "config-service6" deleted
        deployment.apps "service6" deleted
        service "service6" deleted
        configmap "config-service7" deleted
        deployment.apps "service7" deleted
        service "service7" deleted
        configmap "config-service8" deleted
        deployment.apps "service8" deleted
        service "service8" deleted
        configmap "config-service9" deleted
        deployment.apps "service9" deleted
        service "service9" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        configmap/config-service0 created
        deployment.apps/service0 created
        service/service0 created
        configmap/config-service1 created
        deployment.apps/service1 created
        service/service1 created
        configmap/config-service10 created
        deployment.apps/service10 created
        service/service10 created
        configmap/config-service2 created
        deployment.apps/service2 created
        service/service2 created
        configmap/config-service3 created
        deployment.apps/service3 created
        service/service3 created
        configmap/config-service4 created
        deployment.apps/service4 created
        service/service4 created
        configmap/config-service5 created
        deployment.apps/service5 created
        service/service5 created
        configmap/config-service6 created
        deployment.apps/service6 created
        service/service6 created
        configmap/config-service7 created
        deployment.apps/service7 created
        service/service7 created
        configmap/config-service8 created
        deployment.apps/service8 created
        service/service8 created
        configmap/config-service9 created
        deployment.apps/service9 created
        service/service9 created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t1 -c1 -d3s -L http://service0:80/endpoint1
        Running 3s test @ http://service0:80/endpoint1
        1 threads and 1 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency    43.20ms   71.70ms 323.56ms   87.88%
        Req/Sec    61.40     20.48    80.00     80.00%
        Latency Distribution
        50%   13.99ms
        75%   15.12ms
        90%  155.96ms
        99%  322.98ms
        162 requests in 3.01s, 361.65KB read
        Requests/sec:     53.88
        Transfer/sec:    120.29KB
        [run.sh] Speed is 53.88, duration is 55
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t1 -c1 -d55s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        service0-65b756fc78-j2vpv        11m          7Mi
        service1-55d995b5f4-rrdvp        7m           4Mi
        service10-5bbc7c9646-tvkw7       3m           4Mi
        service2-8455cb658c-vnnmn        1m           4Mi
        service3-7bd94467bd-s29k7        23m          4Mi
        service4-5c9457f55c-q4snb        6m           4Mi
        service5-74dff8b46b-slvs4        3m           4Mi
        service6-56c56d699-lztxh         4m           4Mi
        service7-5fb9bc4bd-7pklr         3m           4Mi
        service8-8457fc844f-tsmns        2m           4Mi
        service9-7f8d58d4f5-6mj8d        5m           4Mi
        ubuntu-client-76886f6bbd-62t7l   2m           1Mi
        Running 1m test @ http://service0:80/endpoint1
        1 threads and 1 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency    41.56ms   71.68ms 323.75ms   88.38%
        Req/Sec    60.54     21.43    80.00     84.18%
        Latency Distribution
        50%   14.18ms
        75%   14.72ms
        90%  157.31ms
        99%  322.42ms
        2000 requests in 0.92m, 4.36MB read
        Requests/sec:     36.36
        Transfer/sec:     81.18KB
        ------------------------------
        stop time: 38.967368
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
    [exp] Times: [38.967368]
    [exp] Throughput: 51.32499582727784
[test.py] Baseline throughput:  70.7124687826548
[test.py] Groundtruth:  [76.52458983776404]
[test.py] Slowdown:  [51.32499582727784]
[test.py] Predicted:  [52.72344538858076]
[test.py] Error percentage:  [-31.102609631287017]
[test.py] ++++++++++++++++++++++++++++++++ Summary: 
[test.py] Result for the experiment 0: 
    Baseline throughput: 70.7124687826548
    Groundtruth: [76.52458983776404]
    Slowdown:    [51.32499582727784]
    Predicted:   [52.72344538858076]
    Error Perc:  [-31.102609631287017]